# *- coding: utf-8 -*-
from pyfbsdk import *
# ----------------------------------------------------------------------
# 書き換える場所
oClassName="FBModelNull" # テストしたいクラスの名前
# ----------------------------------------------------------------------
# 全コンポーネントのリスト
lComps = FBSystem().Scene.Components
for lComp in lComps:
    if lComp.Selected==True:
        # リストの中から選択状態のものを取得
        if lComp.ClassName()==oClassName:
            # クラスの絞込み
# ----------------------------------------------------------------------
            # 書き換える場所
            # Pythonヘルプ等で調べた方法で書き換える
            lComp.Show=True
# ----------------------------------------------------------------------